# TODO  Напишите функцию count_letters
rez_dict = {}
def count_letters(a):
    vsp_str = ""
    a = a.lower()
    for i in range(len(a)):
        if a[i].isalpha():
            vsp_str += a[i]

    for letter in vsp_str:
        if letter in rez_dict:
            rez_dict[letter] += 1
        else:
            rez_dict[letter] = 1
    return rez_dict


# TODO Напишите функцию calculate_frequency
def calculate_frequency(a):
    total_sum = sum(a.values())
    new_dict = {}
    for letter in a:
        new_dict[letter] = round(a[letter] / total_sum, 2)
    return new_dict

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""
count_letters(main_str)

# TODO Распечатайте в столбик букву и её частоту в тексте
a = calculate_frequency(rez_dict)
for i in a:
    print(i[0], end=": ")
    print(calculate_frequency(rez_dict)[i], end="\n")

